app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(valid_params('school_class', :title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Comp Sci"], ["room_number", 101], ["created_at", "2021-03-11 00:36:53.367892"], ["updated_at", "2021-03-11 00:36:53.367892"]]